yerih/fet1052/borrar2/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_09 (coord F14), LED_F14 */
/* Routed pin properties */
#define BOARD_INITPINS_F14_PERIPHERAL                                      GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_F14_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_F14_CHANNEL                                            9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_F14_GPIO                                            GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_F14_GPIO_PIN                                           9U   /*!< GPIO pin number */
#define BOARD_INITPINS_F14_GPIO_PIN_MASK                              (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_F14_PORT                                            GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_F14_PIN                                                9U   /*!< PORT pin number */
#define BOARD_INITPINS_F14_PIN_MASK                                   (1U << 9U)   /*!< PORT pin mask */

/* GPIO_EMC_11 (coord G3), G3 */
/* Routed pin properties */
#define BOARD_INITPINS_G3_PERIPHERAL                                        SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_G3_SIGNAL                                            ADDR   /*!< Signal name */
#define BOARD_INITPINS_G3_CHANNEL                                             2U   /*!< Signal channel */

/* GPIO_EMC_19 (coord B4), B4 */
/* Routed pin properties */
#define BOARD_INITPINS_B4_PERIPHERAL                                        SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_B4_SIGNAL                                            ADDR   /*!< Signal name */
#define BOARD_INITPINS_B4_CHANNEL                                            11U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
